{
	"beta": {
		"version_name": "3.9.3",
		"version_code": "267",
		"min_version_code": "183",
		"content": "<b>Версия 3.9.3 (Gallium) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><a href=\"https://telegra.ph/AniLabX-390-Gallium-11-14\">Список изменений! Настоятельно рекомендую посмотреть</a><br/><br/><ul><li>Новое! - Android TV - Новый раздел в боковом меню - Достижения</li>\r\n<li>Новое! - Android TV - Спецальное уведомление о том, как настроить отображение уведомлений на ТВ</li>\r\n<li>FIX! - Манга - Исправлено перелистывание изображений кнопками громкости в GPU-based ридере в режиме свитка</li>\r\n<li>FIX! -  Исправлено отображение неверного меню изменения категорий после быстрого добавления контента в Библиотеку долгим тапом в некоторых случаях</li>\r\n<li>FIX! -  Исправлен вылет из-за установки некорректного прокси</li>\r\n<li>FIX! -  Исправлен вылет при попытке инициализации достижений во Встроенном плеере</li>\r\n<li>FIX! -  Исправлен вылет при попытке установить индивидуальные настройки перелистывания на Авто</li>\r\n<li>FIX! -  Исправлен вылет при попытке отредактировать ссылку на контент в библиотеках без установленного парсера</li>\r\n<li>FIX! -  Исправлен редкий вылет в GPU-based ридере при попытке загрузки индивидуальных настроек перелистывания</li>\r\n<li>FIX! -  Исправлен редкий вылет при попытке закрыть диалог ожидания</li>\r\n<li>FIX! -  Исправлен редкий вылет при попытке обновить список достижений/филлеров с сервера</li>\r\n<li>FIX! -  Исправлен редкий вылет во время загрузки и отображения списка достижений</li>\r\n<li>FIX! -  Исправлен редкий вылет при попытке отобразить список достижений а описании контента</li>\r\n<li>FIX! -  Исправлен редкий вылет при попытке запросить у пользователя разрешение на отображение оверлеев</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.9.3",
		"version_code": "267",
		"min_version_code": "183",
		"content": "<b>Версия 3.9.3 (Gallium) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><a href=\"https://telegra.ph/AniLabX-390-Gallium-11-14\">Список изменений! Настоятельно рекомендую посмотреть</a><br/><br/><ul><li>Новое! - Поддержка аниме достижений, которые выдаются во время просмотра аниме. Привязка достижений к аниме производится на основе данных о привязке аниме к Shikimori</li>\r\n<li>Новое! - Возможность синхронизировать достижения с вашим списком просмотра Shikimori. Достижения будут выданы на основе информации о просмотре контента из ваших списков</li>\r\n<li>Новое! - Поддержка отображения какие эпизоды являются филлерными, а какие - канон. Привязка информации производится на основе данных о привязке аниме к Shikimori</li>\r\n<li>Новое! - Отображение филлер/канон можно настроить на отображение только филлеров, филлеров и канона или выключить отображение полностью</li>\r\n<li>Новое! - Возможность включить в настройках скрытие карточек контента в списках каталогов, если контент уже добавлен в одну из библиотек</li>\r\n<li>Новое! - Добавлен диалог изменения категорий после добавления контента в Библиотеку под динному тапу в списках каталогов. Можно отключить в Настройки - Библиотеки</li>\r\n<li>Удаление несуществующих локально загрузок манги из базы после восстановления бекапа</li>\r\n<li>Конструктор фильтров теперь запоминает и корректно восстанавливает фильтры между перезапусками приложения</li>\r\n<li>Новое! - Видео плеер<changelogtext> Возможность пропускать филлерные эпизоды во встроенном плеере при переключении эпизодов</li>\r\n<li>Новое! - Видео плеер - Возможность отключить отображение скорости буферизации</li>\r\n<li>Новое! - Видео плеер - Добавлена возможность выбрать Свободную портретную и Свободную ландшафтную ориентацию</li>\r\n<li>Новое! - Видео плеер - Отображение уведомлений при смене ориентации в плеере</li>\r\n<li>Новое! - Манга - Функция базовой колоризации черно-белых изображений в GPU-based ридере</li>\r\n<li>Новое! - Манга - Дополнительный 'легкий' декодер в System-based ридере, который установлен по умолчанию. Более тяжелый декодер активируется только при включении Обрезки полей или если произошла ошибка и пользователь нажал 'Повторить'</li>\r\n<li>Новое! - Манга - Редизайн меню мангаридеров</li>\r\n<li>Новое! - Манга - Кнопки быстрого переключения глав</li>\r\n<li>Новое! - Манга - Индивидуальные настройки направления чтения с помощью нового меню в ридерах</li>\r\n<li>Новое! - Ранобэ - Поддержка отключения пользовательской яркости в меню быстрой настройки</li>\r\n<li>Новое! - Android TV - Новые каналы: Shikimori: Запланировано и Shikimori: Смотрю</li>\r\n<li>Новое! - Android TV - Новый раздел в боковом меню - Достижения</li>\r\n<li>Новое! - Android TV - Спецальное уведомление о том, как настроить отображение уведомлений на ТВ</li>\r\n<li>Nephila - Поддержка большего количества сервисов в Веб-плеере</li>\r\n<li>Манга - Отображение прогресса загрузки изображения до самого отображения изображения, а не до фактической загрузки файла в System-based ридере</li>\r\n<li>Android TV - Более корректный скроллинг коментариев в ТВ режиме</li>\r\n<li>FIX! - Манга - Исправлено вечное отображение диалога загрузки глав при попытке продолжить чтение контента без непрочитанных глав кнопкой на карточке</li>\r\n<li>FIX! - Манга - Исправлено чтение архивов в System-based ридере</li>\r\n<li>FIX! - Манга - Исправлено перелистывание изображений кнопками громкости в GPU-based ридере в режиме свитка</li>\r\n<li>FIX! - Ранобэ - Исправлено пропадание кнопок переключения предложений в TTS режиме после первого переключения</li>\r\n<li>FIX! - Ранобэ - Исправление работы кнопки Продолжить чтение на карточке контента</li>\r\n<li>FIX! - Ранобэ - Исправление работы со сторонними ридерами</li>\r\n<li>FIX! - Исправлена ошибка из-за которой иногда дублировался контент в Библиотеках</li>\r\n<li>FIX! - Исправлено некорректное отображение переводов в Фильмах Shikimori. Всегда отображался один перевод</li>\r\n<li>FIX! - Исправлен выбор часового пояса при конвертировании времени в формат 'x часов/минут/секунд назад'</li>\r\n<li>FIX! - Исправлен вылет при попытке удалить отметку о просмотре у эпизодов-папок</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	}
}
