{
	"beta": {
		"version_name": "3.11.0",
		"version_code": "290",
		"min_version_code": "183",
		"content": "<b>Версия 3.11.0 (Hypromellose) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Поддержка архитектуры arm64-v8a</li>\r\n<li>Новое! - Сервис автоматического резервного копирования. Интервал бекапирования можно настроить в Настройки > Резервное копирование. По умолчанию: каждые 24 часа</li>\r\n<li>Новое! - Возможность указания максимального количество хранимых резервных копий</li>\r\n<li>Новое! - Настройка 'Выделять первый непросмотренный эпизод' из Настройки > Основные теперь доступна и в обычном (не TV) режиме</li>\r\n<li>Новое! - Возможность выключить уведомления о получении Достижений в Настройки > Достижения</li>\r\n<li>Новое! - SubsLab - Запуск экспериментального сервиса поиска субтитров SubsLab, который работает во Встроенном плеере</li>\r\n<li>Новое! - SubsLab - В Настройки > Встроенный плеер > Субтитры добавлена настройка предпочитаемого языка при поиске субтитров</li>\r\n<li>Новое! - Nephila - Автоматическое определение номеров сезонов и эпизодов</li>\r\n<li>Новое! - Nephila - Автоматическое определение номеров томов и глав</li>\r\n<li>Новое! - Shikimori - Экспериментальная двусторонняя, автоматическая синхронизация просмотренного с Shikimori. Выключается в Настройки > Shikimori > Синхронизировать просмотренное с Shikimori</li>\r\n<li>Новое! - Shikimori - Экспериментальная двусторонняя, автоматическая синхронизация прочитанного с Shikimori. Выключается в Настройки > Shikimori > Синхронизировать прочитанное с Shikimori</li>\r\n<li>Новое! - Shikimori - Дополнительные визуальные отметки о том, что эпизод/глава отмечен(а) просмотренным/прочитанной на Shikimori</li>\r\n<li>Новое! - Atsumeru - Поддержка более продвинутой двусторонней синхронизации истории чтения</li>\r\n<li>Новое! - Манга - Кнопка отображения оригинального скана вместо переведенного на панели быстрого перевода в System-based ридере. Аналогичный функционал для GPU-based ридера недоступен</li>\r\n<li>Новое! - Видео плеер - Новый диалог выбора качества</li>\r\n<li>Новое! - Видео плеер - Новый диалог выбора скорости воспроизведения</li>\r\n<li>Новое! - Видео плеер - Новый диалог выбора ориентации плеера (вместо цикличного переключения)</li>\r\n<li>Новое! - Видео плеер - Поддержка смены типа субтитров (если доступно несколько типов) во время просмотра (ASS/TTML со стилями или VTT/SRT без стилей)</li>\r\n<li>Новое! - Видео плеер - Новый диалог выбора смены типа субтитров и их включения/отключения</li>\r\n<li>Новое! - Ранобэ - Поддержка перевода выделенных слов/фраз используя Google Translate/MLKit (машинный перевод оффлайн) прямо в приложении</li>\r\n<li>Изменение аглоритма проверки наличия новых эпизодов/глав. Теперь общее значение всех эпизодов/глав сразу записывается в базу данных отдельно от значения новых эпизодов/глав</li>\r\n<li>Shikimori - Алгоритм автоматической связи контента с Shikimori теперь связывает контент из других каталогов если их \"расстояние\" названий больше 81 (было больше 69)</li>\r\n<li>Видео плеер - Небольшой редизайн плеера. Замена фокус-задников на скругленные версии</li>\r\n<li>Манга - Если System-based ридеру не удается декодировать огромное GIF изображение, он переключится на режим декодированя GIF как статичное изображение</li>\r\n<li>Ранобэ - Настройки ридера теперь всегда открывают первым делом дополнительные настройки из приложения с возможностью открыть все настройки</li>\r\n<li>Ранобэ - Сброс настроек теперь сопровождается диалогом-подтверждением</li>\r\n<li>FIX! - Исправлено автоматическое обновление прогресса чтения на карточке контента после использовании функции 'Быстрое чтение'</li>\r\n<li>FIX! - Исправлено некорректное отображение Достижений в описании текстового контента</li>\r\n<li>FIX! - Android TV - Исправлена сортировка доступных качеств в диалоге их выбора</li>\r\n<li>FIX! - Android TV - Исправлено дублирование доступных качеств в диалоге их выбора</li>\r\n<li>FIX! - Android TV - Обновление канала Аниметека после каждого открытия контента из него</li>\r\n<li>FIX! - Манга - Исправлен вылет System-based ридера при попытке загрузить и декодировать огромные GIF изображения</li>\r\n<li>FIX! - Ранобэ - Попытка исправить редкие пропуски глав во время фонового чтения TTS</li>\r\n<li>FIX! - Ранобэ - Исправлен сброс настроек ридера, если база данных вынесена во внешнюю память</li>\r\n<li>FIX! - Ранобэ - Исправлена некорректная активация затухания экрана после того, как TTS сменил главу/книгу</li>\r\n<li>FIX! - Ранобэ - Потенциальное исправление вылета ридера после восстановления из фона. Доработан алгоритм восстановления чтобы данные не терялись</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.10.18",
		"version_code": "288",
		"min_version_code": "183",
		"content": "<b>Версия 3.10.18 (Myelin) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Поддержка новых вариантов поддержки проекта</li>\r\n<li>Новое! - Nephila - Новые возможности парсинга</li>\r\n<li>FIX! - Доработка механизма скачивания ass субтитров. Поддержка хедеров</li>\r\n<li>FIX! - Исправлен вылет приложения, если ass субтитры скачать не удалось</li>\r\n<li>FIX! - Исправление загрузки обложек и сканов в гибридном парсере Manga.ovh</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	}
}
