{
	"beta": {
		"version_name": "3.10.2",
		"version_code": "272",
		"min_version_code": "183",
		"content": "<b>Версия 3.10.2 (Myelin) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Новая кнопка открытия списка каталогов на верхней панели</li>\r\n<li>Новое! - Nephila - Одновременный парсинг Жанров и Тегов</li>\r\n<li>Новое! - Nephila - Новый тип контента: Хентай: Манхва</li>\r\n<li>Возвращение кнопки быстрого включение режима чтения свитком, но приоритет направления чтения все равно отдается индивидуальной настройке конкретного контента</li>\r\n<li>Из списка доступных языков, с которых можно переводить мангу нейропереводчиком, убраны все языки, кроме Английского, Японского, Китайского и Корейского</li>\r\n<li>FIX! - Исправление некоректной выборки контента из х-тек при запросе полного обновления метаданных</li>\r\n<li>FIX! - Исправление редкого вылета при попытке открыть вкладку Anime365 из описания контента из другого каталога</li>\r\n<li>FIX! - Исправление редкого вылета при попытке совершить автоскроллинг к первому непросмотренному эпизоду на ТВ</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.9.5",
		"version_code": "268",
		"min_version_code": "183",
		"content": "<b>Версия 3.9.5 (Gallium) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><a href=\"https://telegra.ph/AniLabX-390-Gallium-11-14\">Список изменений! Настоятельно рекомендую посмотреть</a><br/><br/><ul><li>Новое! - Добавлена сноска в Настройки > Shikimori о том, что пройти CAPTCHA на TV может помочь приложение tvQuickActions или подключение реальной мышки</li>\r\n<li>Новое! - Новый раздел Настроек: Достижения. Возможность включить отображение уведомлений о получении достижений вверху плеера</li>\r\n<li>Улучшен код определения номеров сезона и эпизода для более корректной работы Достижений</li>\r\n<li>Новое! - Android TV - Поддержка автофреймрейта (AFR) с помощью tvQuickActions</li>\r\n<li>Новое! - Android TV - Возможность указать частоту развертки по умолчанию для случаев, когда узнать её автоматически не удалось (по умолчанию: 24)</li>\r\n<li>Новое! - Android TV - Возможность включить/выключить изменение разрешения экрана до разрешения контента при активации AFR (по умолчанию: выкл)</li>\r\n<li>Новое! - Android TV - Скрытие кнопки вкл/выкл достижений, если достижений для эпизода нет</li>\r\n<li>FIX! - Shikimori - Задержка обновления ТВ-каналов Shikimori, чтобы не вылезать за лимиты запросов к серверу</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	}
}
