{
	"beta": {
		"version_name": "3.7.51",
		"version_code": "236",
		"min_version_code": "183",
		"content": "<b>Версия 3.7.51 (Chlorine) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><ul><li>FIX! - Манга - Энкодинг ссылки Referer при запросе изображений</li>\r\n<li>FIX! - Android TV - Из рекомендация на ТВ убрано Порно</li>\r\n<li>FIX! - Исправлен сброс категорий контента после обновления Метаданных</li>\r\n<li>FIX! - Исправлен редкий вылет в поиске</li>\r\n<li>FIX! - Исправлен вылет в поиске при попытке инициализировать историю запросов</li>\r\n<li>FIX! - Исправлен учет платных глав при проверке обновлений в каталогах с отключенным показом данных глав</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.7.51",
		"version_code": "236",
		"min_version_code": "183",
		"content": "<b>Версия 3.7.51 (Chlorine) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><ul><li>Новое! - AniLabX Lite - Возможность скачать AniLabX Lite для ПК из приложения (кнопка в боковом меню и в Настройки - О приложении. Кнопка в боковом меню исчезнет после трех кликов по ней и перезапуска приложения)</li>\r\n<li>Новое! - Видео плеер - Плеер теперь сохраняет свое состояние при перехове в фоновый режим и не перезагружается при выходе из него</li>\r\n<li>Новое! - Android TV - Новая система рекомендаций для Android TV 8+</li>\r\n<li>Новое! - Android TV - Новый канал Аниметека для главного экрана с сортировкой по новым эпизодам</li>\r\n<li>Новое! - Android TV - Реализована поддержка пультов/клавиатуры в обновленном Конструкторе фильтров</li>\r\n<li>Новое! - Android TV - Скрытие виджета батареи в плеере для ТВ режима</li>\r\n<li>Новое! - Манга - Проверка обновлений теперь проверяет и изменяет статус контента в Мангатеке</li>\r\n<li>Новое! - Nephila - Возможность комбинировать парсинг списка глав с главной страницы и нескольких страниц 'вглубь'</li>\r\n<li>Новое! - Nephila - Новый тип контента: Юри (Аниме и Манга)</li>\r\n<li>Новое! - Nephila - Новый флаг для активации режима скачивания 'архив' в котором файл перед началом чтения обязательно должен быть скачан</li>\r\n<li>Новое! - Две новые темы: Элуна (Темно-розовая) и GachiLab (Темно-оранжевая)</li>\r\n<li>Новое! - Возможность полностью обновить метаданные для выбранного контента в х-теке (из контекстного меню контента) или обновить метаданные для всей х-теки из Настройки - Библиотеки - Дополнительные</li>\r\n<li>Новое! - Поддержка скачивания и чтения архивов с изображениями</li>\r\n<li>Новое! - Нажатие на открытую вкладку категории в Аниме/Мангатеке заставит список перепрыгнуть в начало списка</li>\r\n<li>Новое! - Редизайн Репозитория и уменьшение карточек каталогов. Возможность быстрой установки/удаления каталогов по новой кнопке. В ТВ режиме аналогичный функционал доступен по длинному зажатию кнопки ОК на каталоге</li>\r\n<li>Новое! - Добавлено сохранение даты выпуска главы при скачивании оной в кеш</li>\r\n<li>Новое! - В глобальном поиске 'живые' подсказки заменены на показ истории запросов</li>\r\n<li>Android TV - Система рекомендаций отключена для Android TV 8+</li>\r\n<li>Atsumeru - Реализован поиск по контенту на сервере</li>\r\n<li>Из настроек удален Полноэкранный режим для всего приложения, так как он создавал разнообразные проблемы</li>\r\n<li>FIX! - Nephila - Исправлено появление лишних зеркал в ротаторе зеркал на изображения в манге</li>\r\n<li>FIX! - Nephila - Доработана функция скрытия платных глав контента</li>\r\n<li>FIX! - Atsumeru - Исправлено некооректное отображение Atsumeru каталогов в меню парсеров</li>\r\n<li>FIX! - Android TV - Исправлены некорректные множественные результаты в глобальном системном поиске</li>\r\n<li>FIX! - Манга - В System-based ридере исправлено некорректное восстановление прогресса чтения при повторном открытии главы, если включен режим чтения Вебкомикс</li>\r\n<li>FIX! - Экспериментальное исправление множественного запуска приложений поверх друг друга в редких случаях</li>\r\n<li>FIX! - Исправлена ошибка не позволяющая читать локальную мангу без подключения к сети</li>\r\n<li>FIX! - Доработка отображения прочитанных глав в E-Ink теме</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	}
}
