{
	"beta": {
		"version_name": "5.1b3",
		"version_code": "512",
		"min_version_code": "501",
		"content": "<b>Версия 5.1b3 (Aether) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Если в меню Библиотеки после настройки остался один пункт, меню больше не будет отображено</li>\r\n<li>Гибридные каталоги - Улучшение качества обложек в каталогах *Lib</li>\r\n<li>FIX! - Гибридные каталоги - Исправлено некорректное отображение диалога авторизации в каталогах *Lib на старых системах</li>\r\n<li>FIX! - Android TV - Дополнительное скрытие кнопки + с дополнительными функциями для любителей поскроллить списки мышкой на ТВ</li>\r\n<li>FIX! - Видео плеер - Исправлена блокировка изменения громкости кнопками устройства, если отключен встроенный интерфейс изменения</li>\r\n<li>FIX! - Исправлено визуальное исчезновение контента в Несортированные, если была открыта одна библиотека, после вторая, вручную была обновлена категория Несортированные, выполнен возврат в первую библиотеку и также вручную была обновлена категория Несортированные</li>\r\n<li>FIX! - Исправлена возможность бесконечно добавлять один и тот же контент в Библиотеки в некоторых случаях</li>\r\n<li>FIX! - Исправлен интерфейс диалога Скачать главы</li>\r\n<li>FIX! - Исправлен вылет во время авторизации в аккаунте приложения</li>\r\n<li>FIX! - Исправлен вылет при попытке запустить просмотр через неподходящую версию VLC</li>\r\n<li>FIX! - Исправлен редкий вылет во время открытия раздела Статистика</li>\r\n<li>FIX! - Исправлен редкий вылет во время удаления скачанной главы, которой физически нет в памяти устройства</li>\r\n<li>FIX! - Исправлен редкий вылет во время удаления кеша распознанных облачков текста</li>\r\n<li>FIX! - Исправлен редкий вылет после открытия раздела Загрузки</li>\r\n<li>FIX! - Исправлен редкий вылет во время попытки загрузки списка сбойных загрузок</li>\r\n<li>Новое! - Новое обучение основным функциям приложения</li>\r\n<li>Новое! - Новая тема: Хитаги</li>\r\n<li>Новое! - Переезд всех парсеров сети *Lib на гибридные парсеры. ВАЖНО! Возможно несовпадение прогресса! Сверяйтесь с разделом История</li>\r\n<li>Новое! - Авторизация для всех парсеров сети *Lib теперь общая и требует вход только в одном из каталогов, распространяясь на остальные</li>\r\n<li>Новое! - Добавлена возможность кастомизации меню Библиотеки по долгому нажатию или в Настройки > Библиотеки</li>\r\n<li>Новое! - Поддержка и отображение метаданных типа Издатель в описании манги и ранобэ</li>\r\n<li>Новое! - Статус платности главы теперь сохраняется в кеш и отображается в списке глав контента в Мангатеке</li>\r\n<li>Новое! - Добавлена возможность обновить вкладку в библиотеке кнопкой на панели</li>\r\n<li>Новое! - Добавлена возможность повторно выделять элементы в разделе Загрузки по клику</li>\r\n<li>Новое! - Функция 'Удалить отметки о прочтении' заменена на 'Удалить кеш глав', которая также удаляет скачанное, сам кеш глав и пересоздает его заново</li>\r\n<li>Новое! - Редизайн диалога 'Скачать главы'</li>\r\n<li>Новое! - Возможность выбора типа сетки в каталогах: Равномерная или Шахматная (по умолчанию)</li>\r\n<li>Новое! - Возможность выбора стиля карточек: Нормальный (по умолчанию) или Компактный</li>\r\n<li>Новое! - Возможность отключить упаковку скачанных глав в CBZ архивы в Настройки > Скачивание</li>\r\n<li>Новое! - Возможность выделения диапазона загрузок по длинному тапу в разделе Загрузки</li>\r\n<li>Новое! - Возможность отключение анимаций изменения громкости/яркости</li>\r\n<li>Новое! - Возможность отключение нового интерфейса изменения громкости во время изменения громкости кнопками устройства</li>\r\n<li>Новое! - Возможность продолжить чтение скачанных глав кнопкой на обложке без интернета</li>\r\n<li>Новое! - Возможность включить закрытие окон свайпом в Настройки > Основные. По умолчанию отключено</li>\r\n<li>Новое! - Хаб - Виджет времени просмотра дорам</li>\r\n<li>Новое! - Хаб - Виджет времени чтения ранобэ</li>\r\n<li>Новое! - Android TV - Автоматический выбор первого установленного каталога, если в приложении еще не было ни одного каталога</li>\r\n<li>Новое! - Android TV - Замена диалога быстрого выбора на контекстное меню по длинному клику на вкладках</li>\r\n<li>Новое! - Android TV - Возможность включить отображение Ранобэтеки в ТВ-режиме</li>\r\n<li>Новое! - Android TV - Изменено отображение бейджа количества контента в библиотеках и новых эпизодов/глав. Добавлено больше конкретики</li>\r\n<li>Новое! - Android TV - Автоматическое отображение Мангатеки или Ранобэтеки, даже если они выключены в настройках, но содержат контент</li>\r\n<li>Новое! - Android TV - Добавлена возможность открыть Конструктор фильтров в Библиотеке кнопкой на панели</li>\r\n<li>Новое! - Android TV - Открытие всех настроек вместо меню быстрых настроек по кнопке ОК на пульте в GPU-based ридере</li>\r\n<li>Новое! - Android TV - Возможность открыть раздел Статистика</li>\r\n<li>Новое! - Android TV - Добавлены кнопки переключения режима установки каталогов в шапку списка каталогов для удобства использования с пультом</li>\r\n<li>Новое! - Shikimori - Добавлена возможность изменить порядок вкладок в Shikimori-теке в Настройки > Shikimori > Shikimori-тека</li>\r\n<li>Новое! - Shikimori - Добавлена возможность быстро добавить контент в Библиотеку из контекстного меню в Shikimori-теке</li>\r\n<li>Новое! - Shikimori - Открытие контента сразу в каталоге Shikimori из История > Shikimori</li>\r\n<li>Новое! - MyDramaList - Добавлена возможность изменить порядок вкладок в MyDramaList-теке в Настройки > MyDramaList > MyDramaList-тека</li>\r\n<li>Новое! - MyDramaList - Добавлена возможность быстро добавить контент в Библиотеку из контекстного меню в MyDramaList-теке</li>\r\n<li>Новое! - MyDramaList - Поддержка вкладки MyDramaList в Истории</li>\r\n<li>Новое! - MyDramaList - Поддержка автоматической синхронизации просмотренного с MyDramaList</li>\r\n<li>Новое! - MyDramaList - Отображение отметок просмотренных эпизодов с MyDramaList в списке эпизодов и новый фильтр для них</li>\r\n<li>Новое! - Загрузчик - Поддержка отображения активного кеширования видео в виджете загрузки в хабе</li>\r\n<li>Nephila - Улучшения парсинга</li>\r\n<li>Android TV - Переработано окно авторизации. Смещение логотипа влево от полей ввода данных аккаунта</li>\r\n<li>Видео плеер - Переработан механизм построения списка плееров. Подготовка к редизайну диалога выбора плееров. Выбранный плеер по умолчанию будет сброшен</li>\r\n<li>Манга - Улучшено чтение изображений из архивов в GPU-based ридере</li>\r\n<li>Унификация темы</li>\r\n<li>Улучшена читабельность текста некоторых элементов в ярких акцентах</li>\r\n<li>Библиотеки теперь автоматически обновляются, если из каталогов в них был добавлен новый контент</li>\r\n<li>Цвет фона Toast уведомлений теперь совпадает с темой приложения на Android 13+</li>\r\n<li>Ускорение загрузки раздела История</li>\r\n<li>Переработана логика подсчитывания времени просмотра, которая теперь учитывает любые просмотры даже вне библиотек</li>\r\n<li>Отключено редактирование контента по нажатию на прогресс в Библиотеках. В Трекинг сервисах функция остается включенной</li>\r\n<li>Скачанный контент из раздела Загрузки теперь открывается из кеша</li>\r\n<li>Автоматическое разворачивание панели навигации при смене разделов</li>\r\n<li>Удалена поддержка внешних загрузчиков ADM и LoaderDroid</li>\r\n<li>Удалено автоматическое отключение настроек синхронизации с Shikimori</li>\r\n<li>Невозможность игнорирования обновления Достижений/Филлеров, если эти данные ни разу не обновлялись</li>\r\n<li>Ускорение анимаций изменения громкости/яркости в 1.5 раза</li>\r\n<li>Добавлено описание к опции 'Перенести базу данных во внешнюю память'</li>\r\n<li>Опция 'Перенести базу данных во внешнюю память' перенесена в раздел Резервное копирование, так как изначально задумывалась как универсальный метод сохранения библиотеки после удаления приложения</li>\r\n<li>Добавлена дополнительная проверка на наличие CBZ архива с главой во время ее скачивания для нивелирования редкой проблемы бесконечной упаковки</li>\r\n<li>Удалены настройки каталогов из Настройки > Каталоги и аккаунты</li>\r\n<li>Удалены лишние уведомления 'Сервер вернул ошибку' после запуска приложения без интернета</li>\r\n<li>Небольшая реорганизация настроек. Удаление устаревших опций</li>\r\n<li>FIX! - Гибридные каталоги - Исправлена некорректная работа фильтра По Новизне в каталоге AniLibria</li>\r\n<li>FIX! - Гибридные каталоги - Исправлена работа каталога MangaPlus</li>\r\n<li>FIX! - Гибридные каталоги - Исправлена авторизация в каталоге Dark-Novels</li>\r\n<li>FIX! - Гибридные каталоги - Исправление отметок контента в каталоге, который в библиотеке для каталога Desu</li>\r\n<li>FIX! - Гибридные каталоги - Возможность удобного открытия раздела Настройки > Каталоги и аккаунты для авторизации в каталогах Anime365/VK прямо из списка каталогов</li>\r\n<li>FIX! - Хаб - Исправлено зависание активной загрузки в виджете загрузок, если хаб был скрыт до окончания загрузки</li>\r\n<li>FIX! - Android TV - Исправлена невозможность смены Акцента приложения с пульта</li>\r\n<li>FIX! - Android TV - Исправлена невозможность посмотреть детали персонажа из описания контента</li>\r\n<li>FIX! - Android TV - Исправлен редкий вылет при отложенной попытке открыть список каталогов после завершения работы основного окна приложения</li>\r\n<li>FIX! - Android TV - Исправлен редкий вылет при попытке обновления записей в ТВ каналах Shikimori</li>\r\n<li>FIX! - Android TV - Исправлен некорректный цвет выделения карточек в разделе О приложении</li>\r\n<li>FIX! - Android TV - Исправлено отображение недостижимой с пульта кнопки фильтров</li>\r\n<li>FIX! - Android TV - Исправлено выделение текущего раздела в меню после возврата в предыдущий раздел кнопкой Назад</li>\r\n<li>FIX! - Android TV - Исправлена возможность попасть в Хаб выбрав его разделом по умолчанию</li>\r\n<li>FIX! - Видео плеер - Исправлен порядок плееров в диалоге выбора плеера для просмотра</li>\r\n<li>FIX! - Видео плеер - Исправлено некорректное отображение субтитров типа ANY</li>\r\n<li>FIX! - Манга - Исправлен неработающий автопереход на следующую главу в GPU-based ридере во время чтения скачанного контента в режиме свитка</li>\r\n<li>FIX! - Манга - Потенциально исправлен редкий вылет при попытке начать трекинг времени чтения после восстановления мангаридеров из фона</li>\r\n<li>FIX! - Манга - Опция автоперехода на следующую главу теперь включена по умолчанию в GPU-based ридере</li>\r\n<li>FIX! - Ранобэ - Исправлен редкий вылет во время открытия скачанной главы ранобэ из загрузок</li>\r\n<li>FIX! - XRemote - Исправлен редкий вылет во время взаимодействия с сервером/клиентом, когда второе подключение отдало некорректные или пустые данные</li>\r\n<li>FIX! - Синхронизация - Исправлена синхронизация времени чтения, которая учитывала некорректные входные данные и дублировала записи</li>\r\n<li>FIX! - Синхронизация - Исправлен редкий вылет из-за таймаута во время подключения к серверу синхронизации</li>\r\n<li>FIX! - Shikimori - Исправлен вылет во время выбора жанров Манги/Ранобэ в Конструкторе фильтров</li>\r\n<li>FIX! - Shikimori - Исправлен редкий вылет во время загрузки описания контента из Shikimori</li>\r\n<li>FIX! - Shikimori - Исправлен вылет в История > Shikimori, если в список истории загружена информация о регистрации на сайте</li>\r\n<li>FIX! - Shikimori - Исправлено редкое дублирование записей истории в История > Shikimori</li>\r\n<li>FIX! - Shikimori - Исправлена работа функции перемещения контента между списками из контекстного меню контента в Shikimori-теке</li>\r\n<li>FIX! - Shikimori - Исправлено некорректное обновление интерфейса после удаления контента в Shikimori-теке</li>\r\n<li>FIX! - MyDramaList - Исправлена работа функции перемещения контента между списками из контекстного меню контента в MyDramaList-теке</li>\r\n<li>FIX! - MyDramaList - Исправлено некорректное обновление интерфейса после удаления контента в MyDramaList-теке</li>\r\n<li>FIX! - Tracking - Исправлен вылет в Shikimori/MyDramaList-теках во время попытки открыть фильтры до установки любого парсера</li>\r\n<li>FIX! - Загрузчик - Исправлено зависание скачивания глав, если в очереди скачивания находится больше одной главы и удалить загрузку из списка глав</li>\r\n<li>FIX! - Загрузчик - Исправлена работа функции Скачать главы, которая всегда скачивала все главы, независимо от указанного количества</li>\r\n<li>FIX! - Загрузчик - Исправлен вылет во время скачивания контента без корректной записи истории в базе данных. Такие загрузки теперь помечаются ошибкой</li>\r\n<li>FIX! - Загрузчик - Исправлен вылет во время открытия скачанного контента без корректной записи истории в базе данных или с поврежденными файлами</li>\r\n<li>FIX! - Исправлено закрытие приложения, если раздел по умолчанию установлен на Библиотеку и совершена попытка повторно открыть ее из меню</li>\r\n<li>FIX! - Исправлено некорректное отображение статистики просмотра/чтения в виджетах в Хабе</li>\r\n<li>FIX! - Исправлено некорректное отображение количества скачанных эпизодов на карточках в библиотеках</li>\r\n<li>FIX! - Исправлено некорректное отображение кнопок выхода из аккаунта в каталоге</li>\r\n<li>FIX! - Исправлено блокирование приложения в одной ориентации в некоторых случаях</li>\r\n<li>FIX! - Исправлена невозможность авторизации в неактивном каталоге из меню каталогов</li>\r\n<li>FIX! - Исправлена невозможность использования Конструктора фильтров в каталоге, если раздел по умолчанию установлен на Каталоги</li>\r\n<li>FIX! - Исправлена проверка обновлений наличия новых эпизодов для некоторых гибридных каталогов</li>\r\n<li>FIX! - Исправлена некорректная первая проверка наличия новых глав для контента, только добавленного в библиотеку и для которого еще не создан кеш глав</li>\r\n<li>FIX! - Исправлены несрабатывающие фильтры в списке эпизодов во время переходов между папками</li>\r\n<li>FIX! - Исправлено некорректное определение типа локального контента, который открыт с внешней памяти</li>\r\n<li>FIX! - Исправлена некорректная генерация названия глав локального контента</li>\r\n<li>FIX! - Исправлены некорректные цвета меню ридеров в светлой и E-Ink темах</li>\r\n<li>FIX! - Исправлены некорректные цвета кнопок и задника Snackbar</li>\r\n<li>FIX! - Исправлены некорректные цвета кнопок в окне авторизации через WebView</li>\r\n<li>FIX! - Исправлены некорректные цвета CheckBox и RadioButton</li>\r\n<li>FIX! - Исправлены некорректные цвета в диалоге выбора качества стрима во время кеширования эпизода</li>\r\n<li>FIX! - Исправлен некорректный внешний вид карточек в подробностях глобального поиска по каталогу</li>\r\n<li>FIX! - Исправлен вылет при попытке открытия контента с помощью Deep Link</li>\r\n<li>FIX! - Исправлен вылет в Каталогах во время восстановления сохраненного состояния из кеша</li>\r\n<li>FIX! - Исправлен вылет в Хабе во время попытки установить Время чтения/Просмотра</li>\r\n<li>FIX! - Исправлен вылет, если внешняя база данных повреждена. Вместо этого отображается уведомление с призывом восстановить резервную копию</li>\r\n<li>FIX! - Исправлен вылет, если базу данных не удалось открыть из-за ошибки чтения. Вместо этого отображается уведомление с призывом перезапустить приложение</li>\r\n<li>FIX! - Исправлен вылет при попытке открыть открыть Конструктор фильтров в Аудиотеке</li>\r\n<li>FIX! - Исправлен вылет при попытке использования поиска по каталогу без установленных каталогов</li>\r\n<li>FIX! - Исправлен вылет во время попыток войти в аккаунт каталога по логину/паролю</li>\r\n<li>FIX! - Исправлен вылет во время сохранения состояния активного каталога в кеш</li>\r\n<li>FIX! - Исправлен вылет во время удаления кеша распознанных облачков текста манги или комиксов</li>\r\n<li>FIX! - Исправлен вылет во время разрегистрации внутренних компонентов после ухода приложения в фон</li>\r\n<li>FIX! - Исправлены вылеты во время изменения вида списка каталогов в Репозитории, если Репозиторий не загрузился с ошибкой</li>\r\n<li>FIX! - Исправлен редкий вылет во время загрузки разделов Библиотек</li>\r\n<li>FIX! - Исправлен редкий вылет во время загрузки раздела История</li>\r\n<li>FIX! - Исправлен редкий вылет в Веб-плеере на некоторых системах</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке открыть настройки из поиска по настройкам</li>\r\n<li>FIX! - Исправлен вылет при попытке открыть видео в рекламном компоненте MXPlayer, вместо фактического плеера</li>\r\n<li>FIX! - Исправлено некоторое количество утечек памяти</li>\r\n</ul>"
	},
	"release": {
		"version_name": "5.1b3",
		"version_code": "512",
		"min_version_code": "501",
		"content": "<b>Версия 5.1b3 (Aether) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Если в меню Библиотеки после настройки остался один пункт, меню больше не будет отображено</li>\r\n<li>Гибридные каталоги - Улучшение качества обложек в каталогах *Lib</li>\r\n<li>FIX! - Гибридные каталоги - Исправлено некорректное отображение диалога авторизации в каталогах *Lib на старых системах</li>\r\n<li>FIX! - Android TV - Дополнительное скрытие кнопки + с дополнительными функциями для любителей поскроллить списки мышкой на ТВ</li>\r\n<li>FIX! - Видео плеер - Исправлена блокировка изменения громкости кнопками устройства, если отключен встроенный интерфейс изменения</li>\r\n<li>FIX! - Исправлено визуальное исчезновение контента в Несортированные, если была открыта одна библиотека, после вторая, вручную была обновлена категория Несортированные, выполнен возврат в первую библиотеку и также вручную была обновлена категория Несортированные</li>\r\n<li>FIX! - Исправлена возможность бесконечно добавлять один и тот же контент в Библиотеки в некоторых случаях</li>\r\n<li>FIX! - Исправлен интерфейс диалога Скачать главы</li>\r\n<li>FIX! - Исправлен вылет во время авторизации в аккаунте приложения</li>\r\n<li>FIX! - Исправлен вылет при попытке запустить просмотр через неподходящую версию VLC</li>\r\n<li>FIX! - Исправлен редкий вылет во время открытия раздела Статистика</li>\r\n<li>FIX! - Исправлен редкий вылет во время удаления скачанной главы, которой физически нет в памяти устройства</li>\r\n<li>FIX! - Исправлен редкий вылет во время удаления кеша распознанных облачков текста</li>\r\n<li>FIX! - Исправлен редкий вылет после открытия раздела Загрузки</li>\r\n<li>FIX! - Исправлен редкий вылет во время попытки загрузки списка сбойных загрузок</li>\r\n<li>Новое! - Новое обучение основным функциям приложения</li>\r\n<li>Новое! - Новая тема: Хитаги</li>\r\n<li>Новое! - Переезд всех парсеров сети *Lib на гибридные парсеры. ВАЖНО! Возможно несовпадение прогресса! Сверяйтесь с разделом История</li>\r\n<li>Новое! - Авторизация для всех парсеров сети *Lib теперь общая и требует вход только в одном из каталогов, распространяясь на остальные</li>\r\n<li>Новое! - Добавлена возможность кастомизации меню Библиотеки по долгому нажатию или в Настройки > Библиотеки</li>\r\n<li>Новое! - Поддержка и отображение метаданных типа Издатель в описании манги и ранобэ</li>\r\n<li>Новое! - Статус платности главы теперь сохраняется в кеш и отображается в списке глав контента в Мангатеке</li>\r\n<li>Новое! - Добавлена возможность обновить вкладку в библиотеке кнопкой на панели</li>\r\n<li>Новое! - Добавлена возможность повторно выделять элементы в разделе Загрузки по клику</li>\r\n<li>Новое! - Функция 'Удалить отметки о прочтении' заменена на 'Удалить кеш глав', которая также удаляет скачанное, сам кеш глав и пересоздает его заново</li>\r\n<li>Новое! - Редизайн диалога 'Скачать главы'</li>\r\n<li>Новое! - Возможность выбора типа сетки в каталогах: Равномерная или Шахматная (по умолчанию)</li>\r\n<li>Новое! - Возможность выбора стиля карточек: Нормальный (по умолчанию) или Компактный</li>\r\n<li>Новое! - Возможность отключить упаковку скачанных глав в CBZ архивы в Настройки > Скачивание</li>\r\n<li>Новое! - Возможность выделения диапазона загрузок по длинному тапу в разделе Загрузки</li>\r\n<li>Новое! - Возможность отключение анимаций изменения громкости/яркости</li>\r\n<li>Новое! - Возможность отключение нового интерфейса изменения громкости во время изменения громкости кнопками устройства</li>\r\n<li>Новое! - Возможность продолжить чтение скачанных глав кнопкой на обложке без интернета</li>\r\n<li>Новое! - Возможность включить закрытие окон свайпом в Настройки > Основные. По умолчанию отключено</li>\r\n<li>Новое! - Хаб - Виджет времени просмотра дорам</li>\r\n<li>Новое! - Хаб - Виджет времени чтения ранобэ</li>\r\n<li>Новое! - Android TV - Автоматический выбор первого установленного каталога, если в приложении еще не было ни одного каталога</li>\r\n<li>Новое! - Android TV - Замена диалога быстрого выбора на контекстное меню по длинному клику на вкладках</li>\r\n<li>Новое! - Android TV - Возможность включить отображение Ранобэтеки в ТВ-режиме</li>\r\n<li>Новое! - Android TV - Изменено отображение бейджа количества контента в библиотеках и новых эпизодов/глав. Добавлено больше конкретики</li>\r\n<li>Новое! - Android TV - Автоматическое отображение Мангатеки или Ранобэтеки, даже если они выключены в настройках, но содержат контент</li>\r\n<li>Новое! - Android TV - Добавлена возможность открыть Конструктор фильтров в Библиотеке кнопкой на панели</li>\r\n<li>Новое! - Android TV - Открытие всех настроек вместо меню быстрых настроек по кнопке ОК на пульте в GPU-based ридере</li>\r\n<li>Новое! - Android TV - Возможность открыть раздел Статистика</li>\r\n<li>Новое! - Android TV - Добавлены кнопки переключения режима установки каталогов в шапку списка каталогов для удобства использования с пультом</li>\r\n<li>Новое! - Shikimori - Добавлена возможность изменить порядок вкладок в Shikimori-теке в Настройки > Shikimori > Shikimori-тека</li>\r\n<li>Новое! - Shikimori - Добавлена возможность быстро добавить контент в Библиотеку из контекстного меню в Shikimori-теке</li>\r\n<li>Новое! - Shikimori - Открытие контента сразу в каталоге Shikimori из История > Shikimori</li>\r\n<li>Новое! - MyDramaList - Добавлена возможность изменить порядок вкладок в MyDramaList-теке в Настройки > MyDramaList > MyDramaList-тека</li>\r\n<li>Новое! - MyDramaList - Добавлена возможность быстро добавить контент в Библиотеку из контекстного меню в MyDramaList-теке</li>\r\n<li>Новое! - MyDramaList - Поддержка вкладки MyDramaList в Истории</li>\r\n<li>Новое! - MyDramaList - Поддержка автоматической синхронизации просмотренного с MyDramaList</li>\r\n<li>Новое! - MyDramaList - Отображение отметок просмотренных эпизодов с MyDramaList в списке эпизодов и новый фильтр для них</li>\r\n<li>Новое! - Загрузчик - Поддержка отображения активного кеширования видео в виджете загрузки в хабе</li>\r\n<li>Nephila - Улучшения парсинга</li>\r\n<li>Android TV - Переработано окно авторизации. Смещение логотипа влево от полей ввода данных аккаунта</li>\r\n<li>Видео плеер - Переработан механизм построения списка плееров. Подготовка к редизайну диалога выбора плееров. Выбранный плеер по умолчанию будет сброшен</li>\r\n<li>Манга - Улучшено чтение изображений из архивов в GPU-based ридере</li>\r\n<li>Унификация темы</li>\r\n<li>Улучшена читабельность текста некоторых элементов в ярких акцентах</li>\r\n<li>Библиотеки теперь автоматически обновляются, если из каталогов в них был добавлен новый контент</li>\r\n<li>Цвет фона Toast уведомлений теперь совпадает с темой приложения на Android 13+</li>\r\n<li>Ускорение загрузки раздела История</li>\r\n<li>Переработана логика подсчитывания времени просмотра, которая теперь учитывает любые просмотры даже вне библиотек</li>\r\n<li>Отключено редактирование контента по нажатию на прогресс в Библиотеках. В Трекинг сервисах функция остается включенной</li>\r\n<li>Скачанный контент из раздела Загрузки теперь открывается из кеша</li>\r\n<li>Автоматическое разворачивание панели навигации при смене разделов</li>\r\n<li>Удалена поддержка внешних загрузчиков ADM и LoaderDroid</li>\r\n<li>Удалено автоматическое отключение настроек синхронизации с Shikimori</li>\r\n<li>Невозможность игнорирования обновления Достижений/Филлеров, если эти данные ни разу не обновлялись</li>\r\n<li>Ускорение анимаций изменения громкости/яркости в 1.5 раза</li>\r\n<li>Добавлено описание к опции 'Перенести базу данных во внешнюю память'</li>\r\n<li>Опция 'Перенести базу данных во внешнюю память' перенесена в раздел Резервное копирование, так как изначально задумывалась как универсальный метод сохранения библиотеки после удаления приложения</li>\r\n<li>Добавлена дополнительная проверка на наличие CBZ архива с главой во время ее скачивания для нивелирования редкой проблемы бесконечной упаковки</li>\r\n<li>Удалены настройки каталогов из Настройки > Каталоги и аккаунты</li>\r\n<li>Удалены лишние уведомления 'Сервер вернул ошибку' после запуска приложения без интернета</li>\r\n<li>Небольшая реорганизация настроек. Удаление устаревших опций</li>\r\n<li>FIX! - Гибридные каталоги - Исправлена некорректная работа фильтра По Новизне в каталоге AniLibria</li>\r\n<li>FIX! - Гибридные каталоги - Исправлена работа каталога MangaPlus</li>\r\n<li>FIX! - Гибридные каталоги - Исправлена авторизация в каталоге Dark-Novels</li>\r\n<li>FIX! - Гибридные каталоги - Исправление отметок контента в каталоге, который в библиотеке для каталога Desu</li>\r\n<li>FIX! - Гибридные каталоги - Возможность удобного открытия раздела Настройки > Каталоги и аккаунты для авторизации в каталогах Anime365/VK прямо из списка каталогов</li>\r\n<li>FIX! - Хаб - Исправлено зависание активной загрузки в виджете загрузок, если хаб был скрыт до окончания загрузки</li>\r\n<li>FIX! - Android TV - Исправлена невозможность смены Акцента приложения с пульта</li>\r\n<li>FIX! - Android TV - Исправлена невозможность посмотреть детали персонажа из описания контента</li>\r\n<li>FIX! - Android TV - Исправлен редкий вылет при отложенной попытке открыть список каталогов после завершения работы основного окна приложения</li>\r\n<li>FIX! - Android TV - Исправлен редкий вылет при попытке обновления записей в ТВ каналах Shikimori</li>\r\n<li>FIX! - Android TV - Исправлен некорректный цвет выделения карточек в разделе О приложении</li>\r\n<li>FIX! - Android TV - Исправлено отображение недостижимой с пульта кнопки фильтров</li>\r\n<li>FIX! - Android TV - Исправлено выделение текущего раздела в меню после возврата в предыдущий раздел кнопкой Назад</li>\r\n<li>FIX! - Android TV - Исправлена возможность попасть в Хаб выбрав его разделом по умолчанию</li>\r\n<li>FIX! - Видео плеер - Исправлен порядок плееров в диалоге выбора плеера для просмотра</li>\r\n<li>FIX! - Видео плеер - Исправлено некорректное отображение субтитров типа ANY</li>\r\n<li>FIX! - Манга - Исправлен неработающий автопереход на следующую главу в GPU-based ридере во время чтения скачанного контента в режиме свитка</li>\r\n<li>FIX! - Манга - Потенциально исправлен редкий вылет при попытке начать трекинг времени чтения после восстановления мангаридеров из фона</li>\r\n<li>FIX! - Манга - Опция автоперехода на следующую главу теперь включена по умолчанию в GPU-based ридере</li>\r\n<li>FIX! - Ранобэ - Исправлен редкий вылет во время открытия скачанной главы ранобэ из загрузок</li>\r\n<li>FIX! - XRemote - Исправлен редкий вылет во время взаимодействия с сервером/клиентом, когда второе подключение отдало некорректные или пустые данные</li>\r\n<li>FIX! - Синхронизация - Исправлена синхронизация времени чтения, которая учитывала некорректные входные данные и дублировала записи</li>\r\n<li>FIX! - Синхронизация - Исправлен редкий вылет из-за таймаута во время подключения к серверу синхронизации</li>\r\n<li>FIX! - Shikimori - Исправлен вылет во время выбора жанров Манги/Ранобэ в Конструкторе фильтров</li>\r\n<li>FIX! - Shikimori - Исправлен редкий вылет во время загрузки описания контента из Shikimori</li>\r\n<li>FIX! - Shikimori - Исправлен вылет в История > Shikimori, если в список истории загружена информация о регистрации на сайте</li>\r\n<li>FIX! - Shikimori - Исправлено редкое дублирование записей истории в История > Shikimori</li>\r\n<li>FIX! - Shikimori - Исправлена работа функции перемещения контента между списками из контекстного меню контента в Shikimori-теке</li>\r\n<li>FIX! - Shikimori - Исправлено некорректное обновление интерфейса после удаления контента в Shikimori-теке</li>\r\n<li>FIX! - MyDramaList - Исправлена работа функции перемещения контента между списками из контекстного меню контента в MyDramaList-теке</li>\r\n<li>FIX! - MyDramaList - Исправлено некорректное обновление интерфейса после удаления контента в MyDramaList-теке</li>\r\n<li>FIX! - Tracking - Исправлен вылет в Shikimori/MyDramaList-теках во время попытки открыть фильтры до установки любого парсера</li>\r\n<li>FIX! - Загрузчик - Исправлено зависание скачивания глав, если в очереди скачивания находится больше одной главы и удалить загрузку из списка глав</li>\r\n<li>FIX! - Загрузчик - Исправлена работа функции Скачать главы, которая всегда скачивала все главы, независимо от указанного количества</li>\r\n<li>FIX! - Загрузчик - Исправлен вылет во время скачивания контента без корректной записи истории в базе данных. Такие загрузки теперь помечаются ошибкой</li>\r\n<li>FIX! - Загрузчик - Исправлен вылет во время открытия скачанного контента без корректной записи истории в базе данных или с поврежденными файлами</li>\r\n<li>FIX! - Исправлено закрытие приложения, если раздел по умолчанию установлен на Библиотеку и совершена попытка повторно открыть ее из меню</li>\r\n<li>FIX! - Исправлено некорректное отображение статистики просмотра/чтения в виджетах в Хабе</li>\r\n<li>FIX! - Исправлено некорректное отображение количества скачанных эпизодов на карточках в библиотеках</li>\r\n<li>FIX! - Исправлено некорректное отображение кнопок выхода из аккаунта в каталоге</li>\r\n<li>FIX! - Исправлено блокирование приложения в одной ориентации в некоторых случаях</li>\r\n<li>FIX! - Исправлена невозможность авторизации в неактивном каталоге из меню каталогов</li>\r\n<li>FIX! - Исправлена невозможность использования Конструктора фильтров в каталоге, если раздел по умолчанию установлен на Каталоги</li>\r\n<li>FIX! - Исправлена проверка обновлений наличия новых эпизодов для некоторых гибридных каталогов</li>\r\n<li>FIX! - Исправлена некорректная первая проверка наличия новых глав для контента, только добавленного в библиотеку и для которого еще не создан кеш глав</li>\r\n<li>FIX! - Исправлены несрабатывающие фильтры в списке эпизодов во время переходов между папками</li>\r\n<li>FIX! - Исправлено некорректное определение типа локального контента, который открыт с внешней памяти</li>\r\n<li>FIX! - Исправлена некорректная генерация названия глав локального контента</li>\r\n<li>FIX! - Исправлены некорректные цвета меню ридеров в светлой и E-Ink темах</li>\r\n<li>FIX! - Исправлены некорректные цвета кнопок и задника Snackbar</li>\r\n<li>FIX! - Исправлены некорректные цвета кнопок в окне авторизации через WebView</li>\r\n<li>FIX! - Исправлены некорректные цвета CheckBox и RadioButton</li>\r\n<li>FIX! - Исправлены некорректные цвета в диалоге выбора качества стрима во время кеширования эпизода</li>\r\n<li>FIX! - Исправлен некорректный внешний вид карточек в подробностях глобального поиска по каталогу</li>\r\n<li>FIX! - Исправлен вылет при попытке открытия контента с помощью Deep Link</li>\r\n<li>FIX! - Исправлен вылет в Каталогах во время восстановления сохраненного состояния из кеша</li>\r\n<li>FIX! - Исправлен вылет в Хабе во время попытки установить Время чтения/Просмотра</li>\r\n<li>FIX! - Исправлен вылет, если внешняя база данных повреждена. Вместо этого отображается уведомление с призывом восстановить резервную копию</li>\r\n<li>FIX! - Исправлен вылет, если базу данных не удалось открыть из-за ошибки чтения. Вместо этого отображается уведомление с призывом перезапустить приложение</li>\r\n<li>FIX! - Исправлен вылет при попытке открыть открыть Конструктор фильтров в Аудиотеке</li>\r\n<li>FIX! - Исправлен вылет при попытке использования поиска по каталогу без установленных каталогов</li>\r\n<li>FIX! - Исправлен вылет во время попыток войти в аккаунт каталога по логину/паролю</li>\r\n<li>FIX! - Исправлен вылет во время сохранения состояния активного каталога в кеш</li>\r\n<li>FIX! - Исправлен вылет во время удаления кеша распознанных облачков текста манги или комиксов</li>\r\n<li>FIX! - Исправлен вылет во время разрегистрации внутренних компонентов после ухода приложения в фон</li>\r\n<li>FIX! - Исправлены вылеты во время изменения вида списка каталогов в Репозитории, если Репозиторий не загрузился с ошибкой</li>\r\n<li>FIX! - Исправлен редкий вылет во время загрузки разделов Библиотек</li>\r\n<li>FIX! - Исправлен редкий вылет во время загрузки раздела История</li>\r\n<li>FIX! - Исправлен редкий вылет в Веб-плеере на некоторых системах</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке открыть настройки из поиска по настройкам</li>\r\n<li>FIX! - Исправлен вылет при попытке открыть видео в рекламном компоненте MXPlayer, вместо фактического плеера</li>\r\n<li>FIX! - Исправлено некоторое количество утечек памяти</li>\r\n</ul>"
	}
}
