{
	"beta": {
		"version_name": "3.10.0",
		"version_code": "270",
		"min_version_code": "183",
		"content": "<b>Версия 3.10.0 (Myelin) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Лента быстрого доступа в каталогах, которая содержит: кнопку смены каталога, кнопку Мне повезет, кнопки доступных разделов в текущем каталоге</li>\r\n<li>Новое! - Автоматический поиск и установка сервисных парсеров при первом их запросе</li>\r\n<li>Новое! - Поиск по Истории</li>\r\n<li>Новое! - Возможность быстро переустановить каталог (парсер) из контекстного меню каталога в правом боковом меню</li>\r\n<li>Новое! - Возможность менять размер карточек для Shikimori/MDL-тек в Настройки > Внешний вид > Shikimori/MDL > Размер карточек</li>\r\n<li>Новое! - Возможность выключить добавление контента в библиотеку по длинному тапу в Настройки > Библиотеки > Основное</li>\r\n<li>Новое! - В дополнительных вкладках манги, которые иногда появляются внутри описания, после связывания с Shikimori, добавлено отображение названия, обложки и кнопка открытия данной манги в отдельном, полноценном окне</li>\r\n<li>Новое! - Отображение дополнительных вкладок контента из других каталогов в описании контента текущего, если они связаны с одним Shikimori ID</li>\r\n<li>Новое! - Отображение паузы на папках эпизодов в списке эпизодов</li>\r\n<li>Новое! - Кнопка вызова настроек каталога в боковом меню каталогов</li>\r\n<li>Новое! - Проверка обновлений контента больше никогда не будет проверять Синглы</li>\r\n<li>Новое! - Добавлена поддержка подсказок о том, что делать, если каталог не работает</li>\r\n<li>Новое! - Nephila - Поддержка отображения ошибок с сервисов во время получения ссылки на видео (например, когда видео удалено, ссылка не найдена и тд)</li>\r\n<li>Новое! - Видео плеер - Поддержка переключения эпизодов физическими кнопками на пульте</li>\r\n<li>Новое! - Манга - Нейросетевой перевод манги прям в мангаридерах (оптическое расспознавание текста и перевод нейросетью на устройстве или с помощью Google Translate)</li>\r\n<li>Новое! - Манга - Кнопка включения режима чтения Свитком удалена В индивидуальные настройки листания добавлен режим Вебкомикс, который и включает режим свитка Также, теперь его можно включать каждой манге отдельно</li>\r\n<li>Новое! - Манга - Кнопка блокировки вызова меню чтения</li>\r\n<li>Новое! - Манга - Поддержка AVIF/HEIC/WebP в GPU-based ридере при оффлайн чтении и чтении архивов</li>\r\n<li>Новое! - Android TV - Вкладки больше не подписываются большими буквами на ТВ и планшетах</li>\r\n<li>Новое! - Android TV - Добавлена поддержка переключений фокуса в интерфейсе плеера при нажатии физической кнопки Play/Pause</li>\r\n<li>Новое! - Android TV - Переработаны кнопки Play/Pause для устранения их неработоспособности на некоторых устройствах</li>\r\n<li>Новое! - Android TV - Небольшое изменение размеров прогрессбара и скруббера</li>\r\n<li>В окне ошибки замена фразы Открыть в WebView на Проверить в браузере для более точного понимания, что это за кнопка</li>\r\n<li>Отображение кнопки Проверить в браузере в окне ошибки списка глав и эпизодов</li>\r\n<li>Переименования некоторых пунктов меню/кнопок для улучшения начала работы с приложением</li>\r\n<li>Центрирование текста папок/файлов в списке эпизодов</li>\r\n<li>Удаление пункта меню Открыть список каталогов из меню раздела Последние за ненадоюностью</li>\r\n<li>Удаление некоторых обучений при первом запуске</li>\r\n<li>FIX! - Видео плеер - Исправление работы раздельного отключения жестов яркости/громкости в плеере</li>\r\n<li>FIX! - Манга - Скрытие бейджей прогресса чтения при открытии меню ридеров</li>\r\n<li>FIX! - Манга - Исправления гибридного парсера Hitomi_la</li>\r\n<li>FIX! - Android TV - Исправлено появление круглой кнопки справа снизу в каталоге если открыть Shikimori/MDL-теку и перейти в Последние</li>\r\n<li>FIX! - Исправление работы Chromecast</li>\r\n<li>FIX! - Исправлен редкий вылет после изменения значения количества параллельних загрузок видео</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке распарсить сервисную ссылку</li>\r\n<li>FIX! - Исправление подписи раздела Достижения в Настройках</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.9.5",
		"version_code": "268",
		"min_version_code": "183",
		"content": "<b>Версия 3.9.5 (Gallium) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><a href=\"https://telegra.ph/AniLabX-390-Gallium-11-14\">Список изменений! Настоятельно рекомендую посмотреть</a><br/><br/><ul><li>Новое! - Добавлена сноска в Настройки > Shikimori о том, что пройти CAPTCHA на TV может помочь приложение tvQuickActions или подключение реальной мышки</li>\r\n<li>Новое! - Новый раздел Настроек: Достижения. Возможность включить отображение уведомлений о получении достижений вверху плеера</li>\r\n<li>Улучшен код определения номеров сезона и эпизода для более корректной работы Достижений</li>\r\n<li>Новое! - Android TV - Поддержка автофреймрейта (AFR) с помощью tvQuickActions</li>\r\n<li>Новое! - Android TV - Возможность указать частоту развертки по умолчанию для случаев, когда узнать её автоматически не удалось (по умолчанию: 24)</li>\r\n<li>Новое! - Android TV - Возможность включить/выключить изменение разрешения экрана до разрешения контента при активации AFR (по умолчанию: выкл)</li>\r\n<li>Новое! - Android TV - Скрытие кнопки вкл/выкл достижений, если достижений для эпизода нет</li>\r\n<li>FIX! - Shikimori - Задержка обновления ТВ-каналов Shikimori, чтобы не вылезать за лимиты запросов к серверу</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	}
}
