{
	"beta": {
		"version_name": "3.11.5",
		"version_code": "295",
		"min_version_code": "183",
		"content": "<b>Версия 3.11.5 (Hypromellose) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Shikimori - Отображение отметок о том, что данные о просмотре синхронизированы с Shikimori на папках эпизодов</li>\r\n<li>FIX! - Android TV - Скрытие мобильной кнопки 'Показать список каталогов' на панели быстрого доступа в TV режиме</li>\r\n<li>FIX! - Исправлено игнорирование кеша обложек в Истории просмотра/чтения</li>\r\n<li>FIX! - Исправлен вылет при попытке сохранить прогресс просмотра локального контента</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке загрузить обложку в описании контента</li>\r\n<li>FIX! - Исправлен редкий вылет в разделе Коментарии</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке отключить панель опций в списке глав после активации выделения</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке обновить данные о просмотре/чтении с Shikimori</li>\r\n<li>FIX! - Исправления локализации</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.11.5",
		"version_code": "295",
		"min_version_code": "183",
		"content": "<b>Версия 3.11.5 (Hypromellose) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Поддержка архитектуры arm64-v8a</li>\r\n<li>Новое! - Сервис автоматического резервного копирования. Интервал бекапирования можно настроить в Настройки > Резервное копирование. По умолчанию: каждые 24 часа</li>\r\n<li>Новое! - Возможность указания максимального количество хранимых резервных копий</li>\r\n<li>Новое! - Настройка 'Выделять первый непросмотренный эпизод' из Настройки > Основные теперь доступна и в обычном (не TV) режиме</li>\r\n<li>Новое! - Возможность выключить уведомления о получении Достижений в Настройки > Достижения</li>\r\n<li>Новое! - Новые контекстные меню эпизодов/глав</li>\r\n<li>Новое! - В Глобальном поиске первая лента результатов всегда будет отображаться из текущего каталога (при совпадении типов контента)</li>\r\n<li>SubsLab - Запуск экспериментального сервиса поиска субтитров SubsLab, который работает во Встроенном плеере</li>\r\n<li>SubsLab - В Настройки > Встроенный плеер > Субтитры добавлена настройка предпочитаемого языка при поиске субтитров</li>\r\n<li>SubsLab - Исправлено отображение пустоты вместо автора субтитров, если автор не указан</li>\r\n<li>SubsLab - Доработан поиск субтитров для аниме-фильмов</li>\r\n<li>Nephila - Автоматическое определение номеров сезонов и эпизодов</li>\r\n<li>Nephila - Автоматическое определение номеров томов и глав</li>\r\n<li>Shikimori - Экспериментальная двусторонняя, автоматическая синхронизация просмотренного с Shikimori. Выключается в Настройки > Shikimori > Синхронизировать просмотренное с Shikimori</li>\r\n<li>Shikimori - Экспериментальная двусторонняя, автоматическая синхронизация прочитанного с Shikimori. Выключается в Настройки > Shikimori > Синхронизировать прочитанное с Shikimori</li>\r\n<li>Shikimori - Дополнительные визуальные отметки о том, что эпизод/глава отмечен(а) просмотренным/прочитанной на Shikimori</li>\r\n<li>Shikimori - Полное переписывание Конструктора фильтров</li>\r\n<li>Shikimori - Поддержка фильтрации по Лицензиарам в Конструкторе фильтров</li>\r\n<li>Shikimori - Поддержка отображения Лицензиаров в описании контента</li>\r\n<li>Shikimori - 'Соединение' информации в описании контента с данными из Shikimori</li>\r\n<li>Shikimori - Автоматиеческое обновление отметок о синхронизации с Shikimori в списках эпизодов/глав</li>\r\n<li>Shikimori - Исправлена невозможность включить отображение отметок с Shikimori в списках эпизодов/глав, если отображение было отключено</li>\r\n<li>Shikimori - Отображение отметок о том, что данные о просмотре синхронизированы с Shikimori на папках эпизодов</li>\r\n<li>Shikimori - Доработана синхронизации из дополнительных вкладок эпизодов/глав</li>\r\n<li>Shikimori - Автоматическое обновление прогресса просмотра/чтения в Shikimori-теке после изменения прогресса вручную в описании контента или после автосинхронизации. Автоматический перенос контента между категориями после изменений</li>\r\n<li>Shikimori - Алгоритм автоматической связи контента с Shikimori теперь связывает контент из других каталогов если их \"расстояние\" названий больше 81 (было больше 69)</li>\r\n<li>MyDramaList - Исправлена загрузка тегов-констант с MyDramaList в конструкторе фильтров</li>\r\n<li>Atsumeru - Поддержка более продвинутой двусторонней синхронизации истории чтения</li>\r\n<li>Манга - Кнопка отображения оригинального скана вместо переведенного на панели быстрого перевода в System-based ридере. Аналогичный функционал для GPU-based ридера недоступен</li>\r\n<li>Android TV - Исправлена сортировка доступных качеств в диалоге их выбора</li>\r\n<li>Android TV - Исправлено дублирование доступных качеств в диалоге их выбора</li>\r\n<li>Android TV - Обновление канала Аниметека после каждого открытия контента из него</li>\r\n<li>Android TV - У иконки субтитров в плеере убрана подпись On/Off за ненадобностью</li>\r\n<li>Android TV - Скрытие мобильной кнопки 'Показать список каталогов' на панели быстрого доступа в TV режиме</li>\r\n<li>Манга - Если System-based ридеру не удается декодировать огромное GIF изображение, он переключится на режим декодированя GIF как статичное изображение</li>\r\n<li>Манга - Исправлен вылет System-based ридера при попытке загрузить и декодировать огромные GIF изображения</li>\r\n<li>Ранобэ - Настройки ридера теперь всегда открывают первым делом дополнительные настройки из приложения с возможностью открыть все настройки</li>\r\n<li>Ранобэ - Сброс настроек теперь сопровождается диалогом-подтверждением</li>\r\n<li>Ранобэ - Поддержка перевода выделенных слов/фраз используя Google Translate/MLKit (машинный перевод оффлайн) прямо в приложении</li>\r\n<li>Ранобэ - Попытка исправить редкие пропуски глав во время фонового чтения TTS</li>\r\n<li>Ранобэ - Исправлен сброс настроек ридера, если база данных вынесена во внешнюю память</li>\r\n<li>Ранобэ - Исправлена некорректная активация затухания экрана после того, как TTS сменил главу/книгу</li>\r\n<li>Ранобэ - Потенциальное исправление вылета ридера после восстановления из фона. Доработан алгоритм восстановления чтобы данные не терялись</li>\r\n<li>Ранобэ - Ридер больше не перехватывает вылеты, отдавая предпочтение сервису Firebase Crashlytics, что поможет более точно находить и исправлять проблемы</li>\r\n<li>Ранобэ - Полностью переписан механизм кеширования глав в памяти для устранения вылетов после восстановления приложения из фона</li>\r\n<li>Видео плеер - Новый диалог выбора качества</li>\r\n<li>Видео плеер - Новый диалог выбора скорости воспроизведения</li>\r\n<li>Видео плеер - Новый диалог выбора ориентации плеера (вместо цикличного переключения)</li>\r\n<li>Видео плеер - Поддержка смены типа субтитров (если доступно несколько типов) во время просмотра (ASS/TTML со стилями или VTT/SRT без стилей)</li>\r\n<li>Видео плеер - Новый диалог выбора смены типа субтитров и их включения/отключения</li>\r\n<li>Видео плеер - Небольшой редизайн плеера. Замена фокус-задников на скругленные версии</li>\r\n<li>Изменение аглоритма проверки наличия новых эпизодов/глав. Теперь общее значение всех эпизодов/глав сразу записывается в базу данных отдельно от значения новых эпизодов/глав</li>\r\n<li>FIX! - Исправлено автоматическое обновление прогресса чтения на карточке контента после использовании функции 'Быстрое чтение'</li>\r\n<li>FIX! - Исправлено некорректное отображение Достижений в описании текстового контента</li>\r\n<li>FIX! - Исправлена неполная загрузка списков контента в каталоге MangaPlus</li>\r\n<li>FIX! - Исправлена цикличная загрузка списков контента в каталоге MangaPlus</li>\r\n<li>FIX! - Исправлено некорректное отображение пункта меню эпизода 'Отметить просмотренным', если эпизод уже немного просмотренный</li>\r\n<li>FIX! - Исправления в гибридном парсере RаnоbeНub</li>\r\n<li>FIX! - Исправлено некорректное отображение иконки у исключенных фильтров в Конструкторе фильтров</li>\r\n<li>FIX! - Исправлено некорректное дублирование количества новых глав</li>\r\n<li>FIX! - Исправлено обновление общего количества эпизодов/глав после проверки обновлений и открытия контента из х-теки</li>\r\n<li>FIX! - Исправлено игнорирование кеша обложек в Истории просмотра/чтения</li>\r\n<li>FIX! - Исправлен вылет при попытке сохранить прогресс просмотра локального контента</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке загрузить обложку в описании контента</li>\r\n<li>FIX! - Исправлен редкий вылет в разделе Коментарии</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке отключить панель опций в списке глав после активации выделения</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке обновить данные о просмотре/чтении с Shikimori</li>\r\n<li>FIX! - Улучшено опредение номеров эпизодов для названий эпизодов на украинском языке</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке отметить эпизоды просмотренными на основе данных из Shikimori</li>\r\n<li>FIX! - Исправления локализации</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	}
}
