{
	"beta": {
		"version_name": "3.9.2",
		"version_code": "266",
		"min_version_code": "183",
		"content": "<b>Версия 3.9.2 (Gallium) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><a href=\"https://telegra.ph/AniLabX-390-Gallium-11-14\">Список изменений! Настоятельно рекомендую посмотреть</a><br/><br/><ul><li>Новое! - Поддержка аниме достижений, которые выдаются во время просмотра аниме. Привязка достижений к аниме производится на основе данных о привязке аниме к Shikimori</li>\r\n<li>Новое! - Возможность синхронизировать достижения с вашим списком просмотра Shikimori. Достижения будут выданы на основе информации о просмотре контента из ваших списков</li>\r\n<li>Новое! - Поддержка отображения какие эпизоды являются филлерными, а какие - канон. Привязка информации производится на основе данных о привязке аниме к Shikimori</li>\r\n<li>Новое! - Отображение филлер/канон можно настроить на отображение только филлеров, филлеров и канона или выключить отображение полностью</li>\r\n<li>Новое! - Возможность включить в настройках скрытие карточек контента в списках каталогов, если контент уже добавлен в одну из библиотек</li>\r\n<li>Новое! - Добавлен диалог изменения категорий после добавления контента в Библиотеку под динному тапу в списках каталогов. Можно отключить в Настройки - Библиотеки</li>\r\n<li>Удаление несуществующих локально загрузок манги из базы после восстановления бекапа</li>\r\n<li>Конструктор фильтров теперь запоминает и корректно восстанавливает фильтры между перезапусками приложения</li>\r\n<li>Новое! - Видео плеер - Возможность пропускать филлерные эпизоды во встроенном плеере при переключении эпизодов</li>\r\n<li>Новое! - Видео плеер - Возможность отключить отображение скорости буферизации</li>\r\n<li>Новое! - Видео плеер - Добавлена возможность выбрать Свободную портретную и Свободную ландшафтную ориентацию</li>\r\n<li>Новое! - Видео плеер - Отображение уведомлений при смене ориентации в плеере</li>\r\n<li>Новое! - Манга - Функция базовой колоризации черно-белых изображений в GPU-based ридере</li>\r\n<li>Новое! - Манга - Дополнительный 'легкий' декодер в System-based ридере, который установлен по умолчанию. Более тяжелый декодер активируется только при включении Обрезки полей или если произошла ошибка и пользователь нажал 'Повторить'</li>\r\n<li>Новое! - Манга - Редизайн меню мангаридеров</li>\r\n<li>Новое! - Манга - Кнопки быстрого переключения глав</li>\r\n<li>Новое! - Манга - Индивидуальные настройки направления чтения с помощью нового меню в ридерах</li>\r\n<li>Новое! - Ранобэ - Поддержка отключения пользовательской яркости в меню быстрой настройки</li>\r\n<li>Новое! - Android TV - Новые каналы: Shikimori: Запланировано и Shikimori: Смотрю</li>\r\n<li>Nephila - Поддержка большего количества сервисов в Веб-плеере</li>\r\n<li>Манга - Отображение прогресса загрузки изображения до самого отображения изображения, а не до фактической загрузки файла в System-based ридере</li>\r\n<li>Android TV - Более корректный скроллинг коментариев в ТВ режиме</li>\r\n<li>FIX! - Манга - Исправлено вечное отображение диалога загрузки глав при попытке продолжить чтение контента без непрочитанных глав кнопкой на карточке</li>\r\n<li>FIX! - Манга - Исправлено чтение архивов в System-based ридере</li>\r\n<li>FIX! - Ранобэ - Исправлено пропадание кнопок переключения предложений в TTS режиме после первого переключения</li>\r\n<li>FIX! - Ранобэ - Исправление работы кнопки Продолжить чтение на карточке контента</li>\r\n<li>FIX! - Ранобэ - Исправление работы со сторонними ридерами</li>\r\n<li>FIX! - Исправлена ошибка из-за которой иногда дублировался контент в Библиотеках</li>\r\n<li>FIX! - Исправлено некорректное отображение переводов в Фильмах Shikimori. Всегда отображался один перевод</li>\r\n<li>FIX! - Исправлен выбор часового пояса при конвертировании времени в формат 'x часов/минут/секунд назад'</li>\r\n<li>FIX! - Исправлен вылет при попытке удалить отметку о просмотре у эпизодов-папок</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.9.1",
		"version_code": "265",
		"min_version_code": "183",
		"content": "<b>Версия 3.9.1 (Gallium) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><a href=\"https://telegra.ph/AniLabX-390-Gallium-11-14\">Список изменений! Настоятельно рекомендую посмотреть</a><br/><br/><ul><li>FIX! (Для пользователей 3.9.0) - Хотфикс неработающего контекстного меню в Аниме/Мангатеке</li>\r\n<li>Новое! - Возможность отключить затемнение карточек в каталоге, если контент содержится в библиотеках</li>\r\n<li>Новое! - Возможность отключить отметки Возрастных ограничений на карточках контента в х-теках</li>\r\n<li>Новое! - В раздел Помощь проекту - Инструкции добавлена кнопка показа QR-кода для перехода на сайт пожертвований. Для случаев, когда в системе нет браузера (например, ТВ-боксы)</li>\r\n<li>Новое! - Возможность отключить каталоги Shikimori (Базовый) и MyDramaList (Базовый) из настроек данных сервисов</li>\r\n<li>Новое! - Nephila - Новые функции парсинга</li>\r\n<li>Новое! - MyDramaList - Возможность просмотра дорам из каталога. Дополнительная вкладка MyDramaList в дорама-каталогах, если контент связан с MyDramaList</li>\r\n<li>Новое! - Android TV - Новый канал: История Shikimori</li>\r\n<li>Новое! - Видео плеер - Поддержка кеширования внешних субтитров вместе с видео для оффлайн просмотра</li>\r\n<li>Новое! - Манга - Новые библиотеки-декодеры изображений в System-based ридере. Поддержка расширенного спектра JPEG, а также, поддержка WebP/AVIF/HEIC/JPEG XL</li>\r\n<li>Новое! - Манга - GPU-based ридер теперь также поддерживает все указанные выше форматы. Никаких больше 'Ошибка декодирования' с WebP/AVIF изображениями</li>\r\n<li>Новое! - Манга - Поддержка Обрезки пустых границ изображений в System-based и GPU-based ридерах</li>\r\n<li>Новое! - Манга - Кнопка Начать чтение на карточке контента в Мангатеке</li>\r\n<li>Новое! - Манга - Быстрая активация выделения глав по лонгтапу на кнопке Загрузка или Иконке главы</li>\r\n<li>Новое! - Манга - Ускорение анимаций смены страниц свайпом на 30% в GPU-based ридере</li>\r\n<li>Новое! - Манга - Улучшен детект и рендер GIF изображений при чтении скачанной главы с гифками через System-based ридер</li>\r\n<li>Манга - Плашка 'Направление чтения' в мангаридерах больше не перекрывает бейдж количества страниц</li>\r\n<li>Ранобэ - Настройка 'Удалять загруженные главы после прочтения' теперь работает и с ранобэ, но с одним уточнением: прочтенная глава удаляется только после перехода к новой главе в ридере листанием или кнопками громкости</li>\r\n<li>Ранобэ - Доработка скачивания изображений при генерации Epub книг из текстов</li>\r\n<li>Массовое обновление метаданных теперь может исключать из обновления каталоги, которые не поддерживают такую опцию</li>\r\n<li>Улучшенная поддержка киррилический доменных имен для некоторых каталогов</li>\r\n<li>Вкладка История в описании контента теперь всегда отображает актуальные данные</li>\r\n<li>Улучшение логики поиска парсера во время открытии контента по ссылке</li>\r\n<li>Доработка локализации</li>\r\n<li>FIX! - Видео плеер - Улучшение детекта типа субтитров из ссылки</li>\r\n<li>FIX! - Видео плеер - Попытка исправить черные субтитры на прошивках MIUI с форсированной темной темой</li>\r\n<li>FIX! - Манга - Исправлено некорректное отображение бейджа прогресса чтения поверх меню в System-based ридере</li>\r\n<li>FIX! - Манга - Потенциально исправлено исчезновение текста в бейдже прогресса чтения в System-based ридере</li>\r\n<li>FIX! - Манга - Исправлена невозможность скачивания глав контента, если в путь контента просочились запрещенные файловой системой символы</li>\r\n<li>FIX! - Манга - Исправление загрузки превью изображений в System-based ридере, если в пути к файлам есть русские буквы</li>\r\n<li>FIX! - Манга - Исправлено редкое перепрыгивание с текущего читаемого изображения на какой-то другое при смене ориентации в System-based ридере</li>\r\n<li>FIX! - Ранобэ - Исправлено зависание скачиваний текстовых ранобэ в некоторых случаях, когда произошла ошибка скачивания</li>\r\n<li>FIX! - Обучающие окна-подсказки перед появлением сразу отмечаются как отображенные для того, чтобы убрать цикличные вылеты на особых прошивка/устройствах во время их отображения</li>\r\n<li>FIX! - Исправление подвисания приложения при попытке запустить проверку обновлений х-тек из самого приложения</li>\r\n<li>FIX! - Исправлена ошибка из-за которой не работала визуальная смена статуса кеширования видео в разделе Загрузки после использования кнопок Старт все/Пауза все</li>\r\n<li>FIX! - Исправлена ошибка из-за которой торренты скачивались по пути /AniLabX/Temp вместо /AniLabX/Downloads</li>\r\n<li>FIX! - Папка с фильмами в каталоге Shikimori во вкладке Эпизоды теперь подписана как Фильм, а не Сезон 1</li>\r\n<li>FIX! - Исправлено некорректное отображение кнопки 'Добавить в х-теку' в описании контента открытого из уведомления о наличии новых эпизодов/глав</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	}
}
