{
	"beta": {
		"version_name": "3.8.1",
		"version_code": "251",
		"min_version_code": "183",
		"content": "<b>Версия 3.8.1 (Iridium) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><a href=\"https://telegra.ph/AniLabX-380-Spisok-izmenenij-08-12\">Список изменений с видео и картинками новых функций! Настоятельно рекомендую посмотреть</a><br/><br/><ul><li>Версия 3.8.1: Хотфиксы ошибок, некорректной работы System-based ридера и скроллбаров в списке файлов</li>\r\n<li>Новое! - Shikimori - Сервис PlaShiki, который использовался для загрузки списка серий в каталоге Shikimori, закрывается 15-го августа 2021. Он был заменен новым сервисом. Выбор сервера Play.Shikimori удален</li>\r\n<li>Новое! - Shikimori - Контент с каталога Shikimori теперь корректно проверяет количество новых эпизодов и ориентируется на наибольшее количество эпизодов между переводами</li>\r\n<li>Новое! - Видео плеер - Возможность переключения эпизодов в плеере (в обе стороны)</li>\r\n<li>Новое! - Видео плеер - Автопереключение эпизодов в плеере после окончания текущего (включается в настройках)</li>\r\n<li>Новое! - Видео плеер - Новый рендер ASS субтитров. Теперь поддерживается 100% спецификации стилей включая цвета, позиционирование, наклоны, режим караоке, рисование и тд</li>\r\n<li>Новое! - Видео плеер - Возможность быстрой перемотки на 10 секунд нажатием (или на 90 секунд по длинному нажатию) на новые кнопки в интерфейсе плеера (работает в обе стороны)</li>\r\n<li>Новое! - Видео плеер - Возможность в настройках отключить удержание экрана включенным на паузе</li>\r\n<li>Новое! - Видео плеер - Добавлено отображение скорости буферизации</li>\r\n<li>Новое! - Видео плеер - Новая, анимированная, кнопка Play/Pause в плеере</li>\r\n<li>Новое! - Видео плеер - Новая прогрессбар со скругленными углами</li>\r\n<li>Новое! - Видео плеер - Поддержка всего спектра аудиформатов, которые поддерживает ExoPlayer с подключенной библиотекой FFmpeg</li>\r\n<li>Новое! - Ранобэ - Поддержка скачивания следующей главы, с последующим автоматическим ее открытием, при попытке перехода к ней тапом по бокам экрана или клавишами громкости</li>\r\n<li>Новое! - Ранобэ - Поддержка TTS (озвучивание текста) на трех языках (Английский, Русский, Украинский) с дополнительными настройками скорости и поддержкой автосмены главы</li>\r\n<li>Новое! - Nephila - Новые функции парсинга</li>\r\n<li>Новое! - Добавлено отображение уведомлений о необходимости авторизации в каталоге для доступа к открытому контенту (если это необходимо)</li>\r\n<li>Новое! - Проверка обновлений теперь умеет определять количество новых серий для многоуровневого контента (у которого есть разделения на папки) с одним ограничением: суммируются все серии всех переводов и сезонов</li>\r\n<li>Новое! - Встроенный инструмент кеширования видео для дальнейшего оффлайн просмотра</li>\r\n<li>Новое! - Инструмент кеширования видео имеет ограничения: работает только при наличии Расширенных возможностей, кеш хранится только в основной памяти и файлы из кеша нельзя превратить в полноценный файл для своих нужд</li>\r\n<li>Новое! - Встроенный инструмент кеширования поддерживает расширенные настройки требований для старта кеширования и настройки количества потоков/повторов после ошибки</li>\r\n<li>Новое! - Автоматическое резервное копирование и восстановление настроек используя папку AniLabX в роли хранилища бекапа</li>\r\n<li>Новое! - Поиск по настройкам</li>\r\n<li>Новое! - Новые уведомления от сервиса проверки обновлений. Для каждого контента доступно отдельное уведомление с обложкой и группировкой всех уведомлений. Нажав на уведомление, контент откроется в приложении минуя лог проверки</li>\r\n<li>Новое! - Большинство операций загрузки описаний/данных/тд, которые сопровождаются диалоговым окном, теперь можно отменить и закрыть диалог нажав кнопку Назад</li>\r\n<li>Новое! - Убран лимит на скачивания видео для пользователей без Премиума</li>\r\n<li>Новое! - Пользователи без Премиума теперь свободно могут открывать ссылки в сторонних приложениях из диалога выбора видео плеера. Хотя это и не рекомендуется (из-за плохой поддержки некоторых каталогов/сервисов сторонними приложениями)</li>\r\n<li>Новое! - Во время удаления контента из х-теки теперь можно удалить вместе с загруженными файлами и историю просмотра/чтения</li>\r\n<li>Новое! - Swipe to Refresh теперь реагирует на в 2.5 раза длинее свайп для избежания случайных обновлений</li>\r\n<li>Новое! - В Описании контента верхняя панель теперь сворачивается при скролле</li>\r\n<li>Новое! - Полностью иной метод показа/скрытия FAB Продолжить чтение в списке глав при скролле списка</li>\r\n<li>Доработка нового HTTP клиента для поддержки старого типа авторизации</li>\r\n<li>Удаление категории 18+ теперь требует ввода ключа разблокировки, если он установлен</li>\r\n<li>История поиска в глобальном поиске теперь отключена по умолчанию. Включается в Настройки > Основные</li>\r\n<li>Видео плеер - Плеер теперь автоматически выбирает качество видео для HLS/M3U8 потоков на основе настроек предпочитаемого качества. Если в настройках стоит 'Спрашивать', плеер выберет максимальное качество из доступных</li>\r\n<li>Видео плеер - Доработка поддержки Chromecast</li>\r\n<li>Видео плеер - Удален Anime4K</li>\r\n<li>Манга - Скрытие меню System-based ридера при свайпе</li>\r\n<li>FIX! - Shikimori - Автоматический разлогин из аккаунта и показ уведомления о необходимости переавторизации, если авторизация сломалась</li>\r\n<li>FIX! - Shikimori - Исправлено открытие манги/ранобэ по ссылке</li>\r\n<li>FIX! - Shikimori - Исправлено два двоеточия в ифнормации о количестве глав на карточке манги</li>\r\n<li>FIX! - Nephila - Критические исправления работы движка в многопоточном режиме</li>\r\n<li>FIX! - Видео плеер - Исправлен автоматический запуск воспроизведения видео, если устройство заблокировать во время воспроизведения видео и после этого на устройство поступило звуковое уведомление/звонок</li>\r\n<li>FIX! - ReManga. Исправлено некорректое отображение ошибки входа (всегда отображалось уведомление об успешном входе)</li>\r\n<li>FIX! - ReManga. Исправлено декодирование некоторых сканов</li>\r\n<li>FIX! - Исправления в работе парсеров Hitomi</li>\r\n<li>FIX! - Исправлен двойной запуск встроенного плеера в каталоге AnimeVost при выборе качества 480p</li>\r\n<li>FIX! - Исправлена работа поиска в некоторых каталогах (исправлена загрузка обложек и открытие контента из глобального поиска)</li>\r\n<li>FIX! - Исправлено некорректное отображение количества глав в описании контента в некоторых каталогах</li>\r\n<li>FIX! - Исправлено скрытие кнопок управления в Веб-плеере после запуска</li>\r\n<li>FIX! - Исправлена некорректная работа категорий, если в названии встречаются закрывающиеся круглые скобки</li>\r\n<li>FIX! - Потенциальное исправление зависания приложения при попытке сделать скриншот</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.7.53",
		"version_code": "238",
		"min_version_code": "183",
		"content": "<b>Версия 3.7.53 (Chlorine) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><ul><li>FIX! - Видео плеер - Возможность включить старое поведение плеера при переходе в/из фоновый(ого) режим(а), если при восстановлении плеера вы наблюдаете черный экран</li>\r\n<li>FIX! - Видео плеер - Исправлена работа кнопок Play/Pause у системного PiP</li>\r\n<li>FIX! - Видео плеер - При переходе в системный PiP, плеер больше не ставится автоматически на паузу</li>\r\n<li>FIX! - Android TV - Исправление работы алгоритма канала Рекомендаций</li>\r\n<li>FIX! - Android TV - Открытие контента с канала Аниметека теперь загружает кешированную версию контента вместо онлайн версии</li>\r\n<li>FIX! - Android TV - Открытие контента с канала Аниметека также обнуляет количество новых серий в базе данных. Для обновление количества новых серий на карточке в Аниметеке может потребоваться перезагрузка оной</li>\r\n<li>FIX! - Android TV - Возможность ручного обновления канала Рекомендации из Настройки - Дополнительные - Обновить ТВ канал Рекомендации</li>\r\n<li>FIX! - Манга - Исправлена редкая ошибка в системе проверки обновлений, которая учитывала платные главы, даже если их учет был отключен</li>\r\n<li>FIX! - На системах с Android 10+ убрана история поисковых запросов в глобальном поиске, так как она вызывала проблемы в работе приложения</li>\r\n<li>FIX! - Доработка функции 'Отметить просмотренным все предыдущие'</li>\r\n<li>FIX! - Исправлены перепутанные кнопки установки/удаления парсеров в репозитории в светлых темах</li>\r\n<li>FIX! - Исправлен вылет при попытке открыть ссылку в браузере, если в системе стоит только MXPlayer со своим встроенным браузером, который не работает со сторонними приложениями</li>\r\n<li>FIX! - Исправлен редкий вылет в глобальном поиске</li>\r\n<li>FIX! - Исправлен редкий вылет при инициализации приложения</li>\r\n<li>FIX! - Исправлен редкий вылет в Конструкторе фильтров</li>\r\n<li>FIX! - Исправлен редкий вылет во время открытия описания контента, если в процессе что-то пошло не так</li>\r\n<li>FIX! - Исправлен редкий вылет во время открытия описания контента связанный с некорректным состоянием базы данных</li>\r\n<li>FIX! - Исправлен редкий вылет при попытке скачать видео файлы</li>\r\n<li>FIX! - Исправлен редкий вылет во время загрузки AntiDDoS Cookies в движок</li>\r\n<li>FIX! - Исправлен редкий вылет в Истории</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	}
}
