{
	"beta": {
		"version_name": "3.11.2",
		"version_code": "292",
		"min_version_code": "183",
		"content": "<b>Версия 3.11.1 (Hypromellose) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Новые контекстные меню эпизодов/глав</li>\r\n<li>Новое! - В Глобальном поиске первая лента результатов всегда будет отображаться из текущего каталога (при совпадении типов контента)</li>\r\n<li>Новое! - Shikimori - Полное переписывание Конструктора фильтров</li>\r\n<li>Новое! - Shikimori - Поддержка фильтрации по Лицензиарам в Конструкторе фильтров</li>\r\n<li>Новое! - Shikimori - Поддержка отображения Лицензиаров в описании контента</li>\r\n<li>Новое! - Shikimori - 'Соединение' информации в описании контента с данными из Shikimori</li>\r\n<li>Новое! - Shikimori - Автоматиеческое обновление отметок о синхронизации с Shikimori в списках эпизодов/глав</li>\r\n<li>FIX! - Исправлена неполная загрузка списков контента в каталоге MangaPlus</li>\r\n<li>FIX! - Исправлена цикличная загрузка списков контента в каталоге MangaPlus</li>\r\n<li>FIX! - Исправлено некорректное отображение пункта меню эпизода 'Отметить просмотренным', если эпизод уже немного просмотренный</li>\r\n<li>FIX! - Исправления в гибридном парсере RаnоbeНub</li>\r\n<li>FIX! - Исправлено некорректное отображение иконки у исключенных фильтров в Конструкторе фильтров</li>\r\n<li>FIX! - Исправлено некорректное дублирование количества новых глав</li>\r\n<li>FIX! - Исправлено обновление общего количества эпизодов/глав после проверки обновлений и открытия контента из х-теки</li>\r\n<li>FIX! - Shikimori - Исправлена невозможность включить отображение отметок с Shikimori в списках эпизодов/глав, если отображение было отключено</li>\r\n<li>FIX! - MyDramaList - Исправлена загрузка тегов-констант с MyDramaList в конструкторе фильтров</li>\r\n<li>FIX! - Ранобэ - Ридер больше не перехватывает вылеты, отдавая предпочтение сервису Firebase Crashlytics, что поможет более точно находить и исправлять проблемы</li>\r\n<li>FIX! - Ранобэ - Полностью переписан механизм кеширования глав в памяти для устранения вылетов после восстановления приложения из фона</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.10.18",
		"version_code": "288",
		"min_version_code": "183",
		"content": "<b>Версия 3.10.18 (Myelin) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><ul><li>Новое! - Поддержка новых вариантов поддержки проекта</li>\r\n<li>Новое! - Nephila - Новые возможности парсинга</li>\r\n<li>FIX! - Доработка механизма скачивания ass субтитров. Поддержка хедеров</li>\r\n<li>FIX! - Исправлен вылет приложения, если ass субтитры скачать не удалось</li>\r\n<li>FIX! - Исправление загрузки обложек и сканов в гибридном парсере Manga.ovh</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	}
}
