{
	"beta": {
		"version_name": "3.6.2",
		"version_code": "163",
		"min_version_code": "100",
		"content": "<b>Версия 3.6.2 (Tellurium) - Beta</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file?beta=true\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><br/><ul><li>Если в системе нет WebKit, раздел Лог обновлений будет недоступен</li>\r\n<li>Запрос токена VK теперь производится через мобильную версию сайта</li>\r\n<li>Доработка логики удаления прочитанной главы после чтения в System ридере</li>\r\n<li>Локализация</li>\r\n<li>FIX! - Реализована автоотписка от новостей приложения при смене языка приложения ибо появлялись дубликаты уведомлений</li>\r\n<li>FIX! - Исправлен вылет в System читалке при чтении в режиме сверху-вниз и про попытке перейти на несуществующую главу</li>\r\n<li>FIX! - Исправлена неработающая опция установки времени перемотки по длинному тапу</li>\r\n<li>FIX! - Исправлен очень редкий вылет связанный с автоматическим исправлением х-тек после обновления на 3.6.х</li>\r\n<li>FIX! - Потенциально исправлен редкий вылет из-за загрузки огромного количества данных в разделе Последние</li>\r\n<li>FIX! - Если у манги нет глав, ошибка Нет данных теперь отображается корректно</li>\r\n<li>FIX! - Если исправления вылетов плеера на старых ведрах</li>\r\n<li>FIX! - Исправления в логике работы папок с эпизодами</li>\r\n<li>FIX! - Исправление ошибок и вылетов на основе отзывов пользователей</li>\r\n</ul>"
	},
	"release": {
		"version_name": "3.5.21",
		"version_code": "158",
		"min_version_code": "100",
			"content": "<b>Версия 3.5.21 (Helium) - Release</b><br/><a href=\"http://labx.mangawatcherx.com/api/v3/update/file\">Нажмите для скачивания файла через браузер</a><br/>ВНИМАНИЕ!!! Перед обновлением не забывайте делать резервную копию! При любых проблемах - сообщайте по почте или в телеграмм канале <a href=\"https://t.me/joinchat/F9UM8VGcmjwrzIL6TRKf0Q\">LabX Talk</a><br/><br/><br/><ul><li>Полное отключение проверки SSL сертификатов для каталогов. Возобновление работы Anilibria</li>\r\n</ul>"
	}
}
